# Handling Missing Values in a Dataset

There are may Ways to handle missing values:
   1) Imputing with mean, median or mode (mean/median only works for numeric data while, Mode works for categorical data).
   2) USing KNN Algorithm
   3) Regrssion Imputaion
   4) Decision Tree
   5) Random Forest

# 1. Simple Imputation Techniques

## 1.1 Mean/Median Imputation

Mean/Mediam imputation replace missing values with the mean or median of the column. That is a simple and effective method, but has limitaion, it reduces variance in the dataset and it lead to biased estimates if the missing values are not missing at random

### 1.1.1 Mean Imputation

In [43]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
df=pd.read_csv("Titanic-Dataset.csv")

In [45]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [46]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

##

In [47]:
df.isnull().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [48]:
# imputing missing values with mean
df['Age']=df['Age'].fillna(df['Age'].mean())

# checking missing values again
df.isnull().sum().sort_values(ascending=False)

Cabin          687
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [49]:
# droppig Cabin column because it have large number of missing values
df.drop('Cabin',axis=1,inplace=True)

In [50]:
df.isnull().sum().sort_values(ascending=False)

Embarked       2
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
dtype: int64

In [51]:

df=pd.read_csv("Titanic-Dataset.csv")

### 1.1.2 Median/Mode

In [52]:
# imputing missing values with median
df["Age"]=df["Age"].fillna(df['Age'].median())

In [53]:
# imputing missing values with mode
df['Cabin']=df["Cabin"].fillna(df["Cabin"].mode()[0])

df['Embarked']=df["Embarked"].fillna(df["Embarked"].mode()[0])

In [54]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

# 1.2 K-Nearest Neighbour (KNN)

KNN is a machine learning algorithm that can be used to impute missing values. It works by finding the most familiar data points to the one with the missing values based on the other available feature. The missing values is than imputed with the mean or median of the most similar data point.

Implementing KNN using Titanic dataset

In [55]:
data=pd.read_csv("Titanic-Dataset.csv")

In [56]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [57]:
data.isnull().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [58]:
from sklearn.impute import KNNImputer

# calling KNN class with number of neighbour = 4
imputer = KNNImputer(n_neighbors=4)

# impute missing values in age column
data['Age']= imputer.fit_transform(df[['Age']]) # fit means it first learn form data
                                                # transform means it than change the data after learning from it

# checking for the missing values
data.isnull().sum().sort_values(ascending=False)

Cabin          687
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

# 2. Advance Techniques

### 2.1 Multiple Imputation by Chained Equation (MICE)

In [59]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

Iterative imputer means that it will first learn from the columns, and based on those columns it will than impute the missing values

In [60]:
df=pd.read_csv("Titanic-Dataset.csv")

In [61]:
df.isnull().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [62]:
from sklearn.preprocessing import LabelEncoder
# this label encoder converts categorical columns into numerical column automatically

# columns to encode
columns_to_encode=['Sex','Cabin','Age','Embarked','Pclass','Sex','Survived']

# making a dictionary to store labelEncoder for each column
label_encoder={}

# make a loop to apply labelencoder to each column for encodeing
for col in columns_to_encode:
    # apply labelencoder to each column
    le=LabelEncoder()
    # fit and transform the data
    df[col]=le.fit_transform(df[col])
    # store encoder in the dictionary
    label_encoder[col]=le
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,2,"Braund, Mr. Owen Harris",1,28,1,0,A/5 21171,7.2500,147,2
1,2,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,51,1,0,PC 17599,71.2833,81,0
2,3,1,2,"Heikkinen, Miss. Laina",0,34,0,0,STON/O2. 3101282,7.9250,147,2
3,4,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,47,1,0,113803,53.1000,55,2
4,5,0,2,"Allen, Mr. William Henry",1,47,0,0,373450,8.0500,147,2

In [63]:
df.isnull().sum().sort_values(ascending=False)

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [64]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,2,"Braund, Mr. Owen Harris",1,28,1,0,A/5 21171,7.2500,147,2
1,2,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,51,1,0,PC 17599,71.2833,81,0
2,3,1,2,"Heikkinen, Miss. Laina",0,34,0,0,STON/O2. 3101282,7.9250,147,2
3,4,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,47,1,0,113803,53.1000,55,2
4,5,0,2,"Allen, Mr. William Henry",1,47,0,0,373450,8.0500,147,2

In [65]:
# inverse transform for encoded columns
for col in columns_to_encode:
    # retrive the corresponding labelencder for the column
    le = label_encoder[col]
    # inverse transform the data and convert it back to integer type
    df[col] = le.inverse_transform(df[col].astype(int))

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

# 3. Deep Learning Methods

Neural networks, especially autoencoders, can be effective in imputing mssing values in complex datasets. Deep learning methods, particularly neural networks like autoencoders, offer a powerful approach for imputing missing values in complex dataset. These methds are especially useful when the data has intricte,  non-linear relationships that traditional statistical might not capture effectively.

### Understanding Autoencoders For Imputaion

1. **What is an Autoencoder ?** <br>
        An autocoder is a type of neural network that is trained to copy its input to its output.
        It has a hidden layer that describes a code to represent the input.
        The network may be viewed as considering of two parts: a encoder function, which compresses the input into a latent-space representation, and a decoder function, which reconstructs the input from the latent space.

2. **How Autoencoders Work for Imputaion:** <br>
   The key idea is to train the autoencoder to ignore the noise (missing values) in the input data. During training, inputs with missing values are presented, and the network learns to predict the missing values in a way that minimizes reconstruction error for known parts of data. <br>
   This results in the network learning a robust representation of data, enabling it to make  resonable guesses about missing values.

3. **Advantage of Using Autoencoders:** <br>
   **Handling Comple Patterns:** They can capture non-linear relationships in the data, which is particularly useful for complex dataset. <br>
   **Scalability:** They can handle-scale datasets efficiently.<br>
   **Flexibility:** They can be adapted to different types of data(e.g images, text, time-series).

# 4. Regression Imputation

Regression Imputation uses a regression model to predict the missing values based on other variables in the dataset. It works well for both categorical and numerical data

Let's see how to implement regression imputation in python using the titanic dataset.

In [66]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error, mean_absolute_percentage_error
from sklearn.impute import SimpleImputer

In [67]:
df=pd.read_csv("Titanic-Dataset.csv")

# check number of missing values in each column
df.isnull().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

We will remove cabin column because it contaion too many missing values.

In [68]:
# remove cabin column
df.drop("Cabin", axis=1, inplace=True)

# check missing values in each column
df.isnull().sum().sort_values(ascending=True)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
Age            177
dtype: int64

In [69]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [70]:
# encode the data using label encoding
from sklearn.preprocessing import LabelEncoder
# columns to encde
columns_to_encode=["Sex", "Embarked", "Pclass", "Survived",]
# dictionary to store labelEncoders for each column
labelEncoders = {}
# loop to apply labelencoder to each column
for col in columns_to_encode:
    le = LabelEncoder()
    df[col]=le.fit_transform(df[col])
    label_encoder[col]=le
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,2,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,2
1,2,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,0
2,3,1,2,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,2
3,4,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,2
4,5,0,2,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,2

We have to impute the missing values in the age colummn before we can use it to predict the missing values in the embarked column

In [75]:
# split the dataset into two parts: one with the missing values, one without
df_with_missing = df[df['Age'].isna()]
# dropna removes all the rows with missing values
df_without_missing = df.dropna()

lets see the shape of datsets with and without the missing values:

In [76]:
print("The shape of original dataset if: ", df.shape)
print("The shape of the dataset with missing values removed is:", df_without_missing.shape)
print("The shape of dataset with missing values is: ", df_with_missing.shape)

The shape of original dataset if:  (891, 11)
The shape of the dataset with missing values removed is: (714, 11)
The shape of dataset with missing values is:  (177, 11)

In [77]:
df_with_missing.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
5,6,0,2,"Moran, Mr. James",1,NaN,0,0,330877,8.4583,1
17,18,1,1,"Williams, Mr. Charles Eugene",1,NaN,0,0,244373,13.0000,2
19,20,1,2,"Masselmani, Mrs. Fatima",0,NaN,0,0,2649,7.2250,0
26,27,0,2,"Emir, Mr. Farred Chehab",1,NaN,0,0,2631,7.2250,0
28,29,1,2,"O'Dwyer, Miss. Ellen ""Nellie""",0,NaN,0,0,330959,7.8792,1

In [78]:
df_without_missing.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,2,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,2
1,2,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,0
2,3,1,2,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,2
3,4,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,2
4,5,0,2,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,2

In [74]:
print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [79]:
# Regression Imputation
# split the data into X and  and we will only take the column with no missing values
X=df_without_missing.drop(['Age'],axis=1)
y=df_without_missing['Age']

# split the data into training and test sets
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

# Random Forest Imputation
from sklearn.ensemble import RandomForestRegressor
rf_model=RandomForestRegressor(n_estimators=100, random_state=42)
rf_model.fit(X_train,y_train)

# evulate the model
y_pred=rf_model.predict(X_test)
print("RMSE for Random Forest Imputation: ", np.sqrt(mean_squared_error(y_test, y_pred)))
print("R2 Score for Random Forest Imputation: ", r2_score(y_test, y_pred))
print("MAE for random forest imputation: ", mean_absolute_error(y_test, y_pred))
print("MAPE for Random Forest Imputaion: ", mean_absolute_percentage_error(y_test, y_pred))

ValueError: could not convert string to float: 'Goldsmith, Mrs. Frank John (Emily Alice Brown)'

In [80]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error, mean_absolute_percentage_error

# Assuming df_without_missing is already preprocessed except for categorical encoding
X = df_without_missing.drop(['Age'], axis=1)
y = df_without_missing['Age']

# Identify categorical columns
categorical_cols = X.select_dtypes(include=['object']).columns

# Convert categorical columns using One-Hot Encoding
X = pd.get_dummies(X, columns=categorical_cols, drop_first=True)

# Split the data into training and test sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

# Train the Random Forest Regressor
rf_model = RandomForestRegressor(n_estimators=100, random_state=42)
rf_model.fit(X_train, y_train)

# Evaluate the model
y_pred = rf_model.predict(X_test)
print("RMSE for Random Forest Imputation:", np.sqrt(mean_squared_error(y_test, y_pred)))
print("R2 Score for Random Forest Imputation:", r2_score(y_test, y_pred))
print("MAE for Random Forest Imputation:", mean_absolute_error(y_test, y_pred))
print("MAPE for Random Forest Imputation:", mean_absolute_percentage_error(y_test, y_pred))

RMSE for Random Forest Imputation: 12.196145888026594
R2 Score for Random Forest Imputation: 0.19772058041340634
MAE for Random Forest Imputation: 9.407477622377622
MAPE for Random Forest Imputation: 0.4109150010749919

In [81]:
df_with_missing.isnull().sum().sort_values(ascending=False)

Age            177
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         0
dtype: int64

In [84]:
# predict missng values
# Ensure df_with_missing is preprocessed the same way
X_missing = df_with_missing.drop(['Age'], axis=1)

# Identify categorical columns
categorical_cols = X_missing.select_dtypes(include=['object']).columns

# Apply the same encoding as during training
X_missing = pd.get_dummies(X_missing, columns=categorical_cols, drop_first=True)

# Align columns with training data
X_missing = X_missing.reindex(columns=X.columns, fill_value=0)

# Now predict missing values
y_pred = rf_model.predict(X_missing)

In [85]:
import warnings

df_with_missing['Age']=y_pred

df_with_missing.isnull().sum().sort_values(ascending=False)

C:\Users\USER\AppData\Local\Temp\ipykernel_15144\3820286927.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_with_missing['Age']=y_pred

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64